app/Helpers/activity_helper.php

function log_activity($action, $description = null)
{
    $model = new \App\Models\ActivityLogModel();
    $model->insert([
        'user_id' => session()->get('user_id'),
        'action' => $action,
        'description' => $description,
        'ip_address' => \Config\Services::request()->getIPAddress(),
        'user_agent' => \Config\Services::request()->getUserAgent()->getAgentString()
    ]);
---
INSERT INTO `activity_logs` (`user_id`, `action`, `description`, `ip_address`, `user_agent`, `created_at`) VALUES ('1', 'Logout', 'User admin logged out', '::1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/127.0.0.0 Safari/537.36', '2026-04-15 04:23:27')