app/Controllers/Auth.php

    public function attempt()
    {
        $session = session();
        $model = new UserModel();

        $username = $this->request->getVar('username');
        $password = $this->request->getVar('password');

        $user = $model->where('username', $username)
                      ->where('is_active', 1)
                      ->first();
---
SELECT *
FROM `users`
WHERE `username` = 'ha@gmail.com'
AND `is_active` = 1
 LIMIT 1