app/Controllers/Categories.php

    public function index()
    {
        $model = new CategoryModel();
        $data['categories'] = $model->orderBy('id', 'DESC')->findAll();
---
SELECT *
FROM `categories`
ORDER BY `id` DESC

    public function edit($id)
    {
        $model = new CategoryModel();
        $data['category'] = $model->find($id);
---
SELECT *
FROM `categories`
WHERE `categories`.`id` = '2'