app/Controllers/Dashboard.php

    public function index()
    {
        $productModel = new ProductModel();
        $categoryModel = new CategoryModel();
        $saleModel = new SaleModel();
        $userModel = new UserModel();

        $chartData = $saleModel->getDailySalesLast7Days();

        $data = [
            'total_products' => $productModel->countAll(),
            'total_categories' => $categoryModel->countAll(),
            'revenue_today' => $saleModel->getRevenueToday(),
            'total_users' => $userModel->countAll(),
            'low_stock_products' => $productModel->where('quantity <= reorder_level')->countAllResults(),
            'recent_sales' => $saleModel->orderBy('id', 'DESC')->limit(5)->findAll(),
            'top_products' => $saleModel->getTopProducts(5),
            'chart_labels' => json_encode($chartData['labels']),
            'chart_data' => json_encode($chartData['data'])
        ];
---
SELECT COUNT(*) AS `numrows`
FROM `sales`
WHERE DATE(sale_date) = '2026-04-17'
SELECT COUNT(*) AS `numrows` FROM `categories`
SELECT COUNT(*) AS `numrows` FROM `users`
SELECT COUNT(*) AS `numrows`
FROM `products`
WHERE quantity <= reorder_level
SELECT *
FROM `sales`
ORDER BY `id` DESC
 LIMIT 5