app/Controllers/Logs.php

SELECT COUNT(*) AS `numrows`
FROM `activity_logs`
LEFT JOIN `users` ON `users`.`id` = `activity_logs`.`user_id`
SELECT `activity_logs`.*, `users`.`full_name` as `user_name`
FROM `activity_logs`
LEFT JOIN `users` ON `users`.`id` = `activity_logs`.`user_id`
ORDER BY `activity_logs`.`id` DESC
 LIMIT 20
---
    public function index()
    {
        $model = new ActivityLogModel();
        $data['logs'] = $model->select('activity_logs.*, users.full_name as user_name')
                              ->join('users', 'users.id = activity_logs.user_id', 'left')
                              ->orderBy('activity_logs.id', 'DESC')
                              ->paginate(20);