app/Controllers/Pos.php

SELECT *
FROM `products`
WHERE `status` = 1
AND `quantity` > 0
ORDER BY `name` ASC
---
    public function index()
    {
        $productModel = new ProductModel();
        $data['products'] = $productModel->where('status', 1)
                                          ->where('quantity >', 0)
                                          ->orderBy('name', 'ASC')
                                          ->findAll();