app/Controllers/Products.php

    public function index()
    {
        $model = new ProductModel();
        $data['products'] = $model->select('products.*, categories.name as category_name')
                                  ->join('categories', 'categories.id = products.category_id', 'left')
                                  ->orderBy('products.id', 'DESC')
                                  ->findAll();
---
SELECT `products`.*, `categories`.`name` as `category_name`
FROM `products`
LEFT JOIN `categories` ON `categories`.`id` = `products`.`category_id`
ORDER BY `products`.`id` DESC

    public function edit($id)
    {
        $model = new ProductModel();
        $data['product'] = $model->find($id);
        if (!$data['product']) {
            return redirect()->to('/products')->with('error', 'Product not found');
        }
        $categoryModel = new CategoryModel();
        $data['categories'] = $categoryModel->where('status', 1)->findAll();
---
SELECT *
FROM `products`
WHERE `products`.`id` = '2'
SELECT *
FROM `categories`
WHERE `status` = 1