app/Controllers/Sales.php

    public function index()
    {
        $model = new SaleModel();
        try {
            $data['sales'] = $model->select('sales.*, users.full_name as cashier')
                                   ->join('users', 'users.id = sales.user_id', 'left')
                                   ->orderBy('sales.id', 'DESC')
                                   ->findAll();
---
SELECT `sales`.*, `users`.`full_name` as `cashier`
FROM `sales`
LEFT JOIN `users` ON `users`.`id` = `sales`.`user_id`
ORDER BY `sales`.`id` DESC

    public function create()
    {
        $productModel = new ProductModel();
        $data['products'] = $productModel->where('quantity >', 0)->where('status', 1)->findAll();
---
SELECT *
FROM `products`
WHERE `quantity` > 0
AND `status` = 1