app/Controllers/Shop.php

SELECT *
FROM `products`
WHERE `products`.`id` = '7'
---
    public function addToCart()
    {
        $productId = $this->request->getPost('product_id');
        $quantity = (int)$this->request->getPost('quantity');

        $productModel = new ProductModel();
        $product = $productModel->find($productId);

SELECT *
FROM `products`
WHERE `products`.`id` = '1'
---
    public function updateCart()
    {
        $productId = $this->request->getPost('product_id');
        $quantity = (int)$this->request->getPost('quantity');

        $cart = session()->get('cart') ?? [];
        if (!isset($cart[$productId])) {
            return redirect()->back()->with('error', 'Product not in cart.');
        }

        if ($quantity <= 0) {
            unset($cart[$productId]);
        } else {
            // Validate against current stock
            $productModel = new ProductModel();
            $product = $productModel->find($productId);