app/Controllers/Stock.php

    public function index()
    {
        $productModel = new ProductModel();
        $data['products'] = $productModel->select('products.*, categories.name as category_name')
                                         ->join('categories', 'categories.id = products.category_id', 'left')
                                         ->orderBy('products.quantity', 'ASC')
                                         ->findAll();
---
SELECT `products`.*, `categories`.`name` as `category_name`
FROM `products`
LEFT JOIN `categories` ON `categories`.`id` = `products`.`category_id`
ORDER BY `products`.`quantity` ASC

    public function adjust()
    {
        $productModel = new ProductModel();
        $data['products'] = $productModel->where('status', 1)->findAll();
---
SELECT *
FROM `products`
WHERE `status` = 1

    public function logs()
    {
        $stockLogModel = new StockLogModel();
        $data['logs'] = $stockLogModel->select('stock_logs.*, products.name as product_name, users.full_name as user_name')
                                      ->join('products', 'products.id = stock_logs.product_id')
                                      ->join('users', 'users.id = stock_logs.user_id', 'left')
                                      ->orderBy('stock_logs.id', 'DESC')
                                      ->findAll();
---
SELECT `stock_logs`.*, `products`.`name` as `product_name`, `users`.`full_name` as `user_name`
FROM `stock_logs`
JOIN `products` ON `products`.`id` = `stock_logs`.`product_id`
LEFT JOIN `users` ON `users`.`id` = `stock_logs`.`user_id`
ORDER BY `stock_logs`.`id` DESC