app/Models/SaleModel.php

SELECT `products`.`name`, SUM(sale_items.quantity) as total_sold
FROM `sale_items`
JOIN `products` ON `products`.`id` = `sale_items`.`product_id`
GROUP BY `sale_items`.`product_id`
ORDER BY `total_sold` DESC
 LIMIT 5
---
    public function getTopProducts($limit = 5)
    {
        return $this->db->table('sale_items')
                        ->select('products.name, SUM(sale_items.quantity) as total_sold')
                        ->join('products', 'products.id = sale_items.product_id')
                        ->groupBy('sale_items.product_id')
                        ->orderBy('total_sold', 'DESC')
                        ->limit($limit)
                        ->get()
                        ->getResultArray();